package code.lib

import code.model.CustomerCode

/**
 *  用來透過「料號」取得客戶名稱的工具程式
 */
object Customer {

  /**
   *  從「料號」中取得客戶名稱，料號的編碼格式為 24 碼，範例如下：
   *
   *  THW1E331ML1012MRC3-0117A
   *
   *  其中第 0117 即為客戶代碼，這個函式會取出這個客戶代碼，再至
   *  customers 這個 HashMap 中查詢其名稱
   *
   *  @param    partNo       原始的料號
   *  @return                客戶名稱，若查無此客戶代碼則為 Unknown
   */
  def fromPartNo(partNo: String) = try {
    partNo.substring(19, 23)
  } catch {
    case e: Exception => "Unknown"
  }

  /**
   *  從客戶代碼對應到客戶名稱的 HashMap
   */
  def getCustomers = CustomerCode.findAll.toList.map { record => (record.customerCode.get, record.customerTitle.get) }.toMap

  /*
  val customers = Map(
    "0002" -> "惠州益源",
    "0004" -> "威海集團",
    "0022" -> "台達",
    "0024" -> "泰金寶",
    "0029" -> "飛宏",
    "0030" -> "光寶",
    "0035" -> "Foxconn",
    "0036" -> "碩天",
    "0037" -> "HITACHI",
    "0038" -> "SIRTEC",
    "0041" -> "峻凌",
    "0042" -> "KMAX",
    "0047" -> "環勝",
    "0048" -> "揚皓",
    "0050" -> "明泰",
    "0052" -> "智邦",
    "0057" -> "邁特",
    "0059" -> "上海國璉",
    "0061" -> "AVISION",
    "0062" -> "MICROT",
    "0063" -> "緯創資通",
    "0065" -> "仕野",
    "0067" -> "technicolor",
    "0075" -> "訊動",
    "0076" -> "康舒",
    "0079" -> "五寰",
    "0082" -> "SILORA",
    "0086" -> "智易",
    "0109" -> "亞旭",
    "0112" -> "達方",
    "0116" -> "Flextronics",
    "0117" -> "全漢",
    "0134" -> "Astec",
    "0138" -> "群光",
    "0141" -> "柏怡",
    "0148" -> "立德",
    "0150" -> "瑞軒",
    "0160" -> "正文",
    "0161" -> "建漢重慶",
    "0164" -> "ITSUWA",
    "0169" -> "Jabil",
    "0170" -> "百一",
    "0178" -> "亞國",
    "0181" -> "友勁",
    "0194" -> "僑威",
    "0196" -> "亞元",
    "0200" -> "Aztech",
    "0202" -> "友電",
    "0203" -> "優源",
    "0205" -> "深圳創維",
    "0206" -> "KIEBACK",
    "0208" -> "源創 龍崗",
    "0212" -> "懷藝",
    "0214" -> "翌胜電子",
    "0216" -> "生富電子",
    "0217" -> "上海大亞",
    "0219" -> "ELCOTEQ-J",
    "0220" -> "寬兆深圳",
    "0223" -> "凱碩沛豐",
    "0224" -> "友興",
    "0225" -> "Adapter",
    "0228" -> "力英",
    "0229" -> "名碩",
    "0231" -> "TP LINK",
    "0234" -> "上軒",
    "0235" -> "世派",
    "0236" -> "寰永",
    "0239" -> "TAMURA",
    "0241" -> "鴻松行動",
    "0243" -> "建光達",
    "0244" -> "ADB HK",
    "0250" -> "東莞益衡",
    "0251" -> "錦輝",
    "0252" -> "中山聚東",
    "0256" -> "亞帝歐",
    "0257" -> "DMC",
    "0258" -> "仁寶光電",
    "0259" -> "威愷",
    "0260" -> "呈威",
    "0261" -> "歐陸通",
    "0262" -> "倍碟科技",
    "0263" -> "華菱",
    "0264" -> "勝華",
    "0265" -> "藍波",
    "0266" -> "億光",
    "0267" -> "炬能",
    "0268" -> "賽爾康",
    "0269" -> "POWER",
    "0270" -> "杭州晶電",
    "0271" -> "慧思",
    "0272" -> "foxlink",
    "0273" -> "盟創",
    "0274" -> "金寶通德鵬",
    "0275" -> "敏銳ASTUTE",
    "0276" -> "光順",
    "0277" -> "揚泰",
    "0278" -> "東貝",
    "0279" -> "神基",
    "0280" -> "雲創",
    "0281" -> "永洋協盈",
    "0282" -> "飛勝",
    "0285" -> "奇燁奇城",
    "0286" -> "浙江涵普",
    "0287" -> "寶盛德",
    "0288" -> "博源",
    "0289" -> "華燊",
    "0290" -> "三迪",
    "0291" -> "四川長虹",
    "0292" -> "瀚碩",
    "0293" -> "Essae",
    "0294" -> "鼎之奇",
    "0295" -> "奇城路華",
    "0296" -> "奇城瑞晶",
    "0297" -> "長田電子",
    "0299" -> "時信",
    "0300" -> "能極",
    "0301" -> "海柯電子",
    "0302" -> "友旺科技",
    "0303" -> "恒茂電子",
    "0304" -> "航嘉馳源",
    "0305" -> "蜜望實",
    "0306" -> "宏隼奇城",
    "0307" -> "兆赫",
    "0308" -> "普揚",
    "0310" -> "邁思普奇城",
    "0311" -> "圓方",
    "0326" -> "威力暘",
    "0068" -> "BOSS光寶",
    "0318" -> "金富胜",
    "0313" -> "蘇州高創"
  )
  */

}
